# Чернеги Вікторії   Б19_д/122Б
'''
Введіть з клавіатури в масив п'ять цілочисельних значень. Виведіть їх в
один рядок через кому. Отримайте для масиву середнє арифметичне.
'''


import numpy as np                                  # імпортування бібліотеки
array = np.zeros(5, dtype = int)                    # масив, заповнений нулями типу int
summa = 0                                           # змінна, яка буде обраховувати суму всіх значень елементів масиву
for i in range(len(array)):                         # цикл для проходження по елементам масиву
    array[i] = int(input(f'Element {i} = '))        # заповнення масиву
    summa += array[i]                               # додавання всіх елементів масиву
print(list(array))                                  # вивід масиву через кому
print(f'Average: {summa/5}')                        # виведення середнього арифметичного всіх елементів масиву