# Чернеги Вікторії   Б19_д/122Б
'''
Дані про температуру води на Чорноморському узбережжі за декаду
вересня зберігаються в масиві. Визначити, скільки за цей час було днів, придатних для
купання.
'''

temperature = [25, 27, 22, 24, 28, 19, 21, 18, 25, 26]                  # масив з температурами
count = 0                                                               # змінна для рахунку кількості днів
for i in range(len(temperature)):                                       # цикл для проходження по масиву
    if temperature[i] > 20:                                             # умова, при якій температура вище 20
        count += 1                                                      # якщо умова виконується, до лічильника додається 1
print(f'There was {count} days you could swim')                         # вивід кількості придатних для купання днів