# Чернеги Вікторії   Б19_д/122Б
'''
Дані про температуру повітря за декаду грудня зберігаються в масиві.
Визначити, скільки раз температура була вище середньої за цю декаду.
'''


temperature = [1, -2, -15, -23, -11, -3, -1, -5, -6, -7]                # масив з температурами
summa, count = 0, 0                                                     # сума всіх температур та лічильник кількості днів
for i in range(len(temperature)):                                       # цикл для проходження по елементам масиву
    summa += temperature[i]                                             # сума всіх температур масиву
average = summa/len(temperature)                                        # середня температура умова
for i in range(len(temperature)):                                       # цикл для проходження по елементам масиву
    if temperature[i] > average:                                        # умова, при якій температура вище середньої
        count += 1                                                      # якщо кмова виконується, то до лічильника додається 1
print(f'{count} times the temperature was higher than average')         # вивід кількості температур вище середнього