# Чернеги Вікторії   Б19_д/122Б
'''
Створіть масив з 15 цілочисельних елементів і визначте серед них мінімальне значення.
'''

import numpy as np                          # імпортування бібліотек
import random

array = np.zeros(15, dtype = int)           # масив, заповнений нулями
for i in range(len(array)):                 # цикл для проходження по елементам масиву
    array[i] = random.randint(-10, 10)      # внесення в масив рандомних значень
print(array)                                # вивід масиву
print(f'Minimum: {min(array)}')             # вивід найменшого значення за допомогою функції min()