# Чернеги Вікторії   Б19_д/122Б
'''
Сформуйте лінійний масив дійсних чисел, елементи якого є відстанями,
пройденими тілом при вільному падінні на землю за 1, 2, ..., 10 с.
'''

import numpy as np                                                              # імпортування бібліотеки

distance = np.zeros(10, dtype = float)                                          # заповнення масиву нулями типу
g, h = 9.8, float(input("Введіть значення висоти, з якої падає об'єкт: "))      # g - прискорення вільного падіння, h - висота, з якої падає тіло(вводиться користувачем)
i = 0                                                                           # індекси об'єктів(в циклі збільшуєьбся на 1, таким чином відбувається проходження)
for t in range(1, 11):                                                          # цикл, для проходження по часу в межах 10 секунд
    speed = g * t                                                               # формула швидкості
    distance[i] = speed / h                                                     # формула відстані, що проходить тіло за певний час
    i += 1                                                                      # перехід до відстані наступної секунди
print(distance)                                                                 # виведення масиву з відстанями
