# Чернеги Вікторії   Б19_д/122Б
'''
Знайти добуток елементів масиву цілих чисел, які кратні 7. Розмірність
масиву - 15. Заповнення масиву здійснити випадковими числами від 10 до 50.
'''

import numpy as np                                  # імпортування бібліотек
import random

array = np.zeros(20, dtype = int)                   # масив, заповнений нулями типу int
dob = 1                                             # змінна, шо позначає добуток елементів, що діляться на 7
for i in range(len(array)):                         # цикл для заповнення масиву елементами
    array[i] = random.randint(10, 50)               # внесення рандомних елементів в діапазоні від 10 до 50 в масив
print(array)                                        # виведення масиву
for i in range(len(array)):                         # цикл для проходження по елементам масиву
    if array[i]%7 == 0:                             # перевірка чи ділиться елемент на 7 націло
        dob *= array[i]                             # якщо ділиться, то елемент домножується на добуток
if dob == 1:                                        # перевірка чи є в масиві взагалі елементи кратні 7
    print('Немає елементів кратних 7')
else:                                               # якщо такі елементи є, то виводиться їх добуток
    print(f'Добуток елементів кратних 7: {dob}')