# Чернеги Вікторії   Б19_д/122Б
'''
Знайти добуток всіх елементів масиву цілих чисел, менших 0. Розмірність
масиву - 10. Заповнення масиву здійснити за допомогою клавіатури.
'''

import numpy as np                                      # імпортування бібліотек

array = np.zeros(10, dtype = int)                       # масив заповнений нулями типу int
dob = 1                                                 # змінна, що позначає добуток елементів
for i in range(len(array)):                             # цикл для заповнення елементів значеннями з клавіатури
    array[i] = int(input(f'Element{i} = '))
print(array)                                            # виведення масиву
for i in range(len(array)):                             # цикл для проходження по масиву
    if array[i] < 0:                                    # перевірка, чи елемент менше 0
        dob *= array[i]                                 # якщо так, він множиться
if dob == 1:                                            # перевірка чи є в масиву елементи менше нуля
    print('There is no negative elements')              # якщо немає, введення інформації про це
else:                                                   # якщо є виведення добутку таких елементів
    print(f'Composition  of negative elements: {dob}')