# Чернеги Вікторії   Б19_д/122Б
'''
Знайти суму всіх елементів масиву цілих чисел що задовольняють умові:
остача від ділення на 2 дорівнює 3. Розмірність масиву - 20. Заповнення масиву
здійснити випадковими числами від 200 до 300.
'''

import numpy as np                                  # імпортування бібліотек
import random

array = np.zeros(20, dtype = int)                   # масив, заповнений нулями типу int
sum = 0                                             # змінна, шо позначає суму елементів, остача від ділення на 2 яких дорівнює 3
for i in range(len(array)):                         # цикл для заповнення масиву елементами
    array[i] = random.randint(200, 300)             # внесення рандомних елементів в діапазоні від 200 до 300 в масив
print(array)                                        # виведення масиву
for i in range(len(array)):                         # цикл для проходження по елементам масиву
    if array[i]%2 == 3:                             # якщо ділення елементу масиву на 2 залишає остачу 3, то цей елемент додається
        sum += array[i]
if sum == 0:                                        # якщо елементів, що діляться на 2 з остачею 3 немає, виведення інформаці про це
    print('There is no such elements')
else:                                               # якщо такі елементи є (їх не буде, бо ділення на 2 з остачею 3 не можливе), то виведення суми цих елементів
    print(f'Amount: {sum}')