# Чернеги Вікторії   Б19_д/122Б
'''
Введіть з клавіатури п'ять цілочисельних елементів масиву X. Виведіть на
екран значення коріння і квадратів кожного з елементів масиву.
'''

import numpy as np                                          # імпортування бібліотек
import math
X = np.zeros(5, dtype = int)                                # масив, заповнений нулями типу int
for i in range(len(X)):                                     # цикл для проходження по елементам масиву
    X[i] = int(input(f'Element {i} = '))                    # заповнення масиву
    print(f'Square root of {X[i]} = {math.sqrt(X[i])}')     # вивід кореня квадратного елемента масиву одразу після його введення
    print(f'{X[i]} squared = {X[i]**2}')                    # вивід квадрату елемента масиву одразу після його введення