# Чернеги Вікторії   Б19_д/122Б
'''
Знайти добуток всіх елементів масиву дійсних чисел, менших заданого
числа. Розмірність масиву - 10. Заповнення масиву здійснити випадковими числами
від 50 до 100.
'''

import numpy as np                                  # імпортування бібліотек
import random

n = float(input('Your number: '))                   # число, з яким порівнюються елементи масиву
array = np.zeros(10, dtype = float)                 # масив, заповнений нулями типу float
dob = 1                                             # змінна, шо позначає добуток елементів менших за задане число
for i in range(len(array)):                         # цикл для заповнення масиву елементами
    array[i] = random.uniform(50,100)               # внесення в масив рандомних значень типу float в діапазоні від 50 до 100
print(array)                                        # виведення масиву
for i in range(len(array)):                         # цикл для проходження по елементам масиву
    if array[i] < n:                                # якщо елемент масиву менший за заданий, він домножується
        dob *= array[i]
if dob == 1:                                        # якщо менших елементів ніж задане число немає, виведення інформації про це
    print(f'All the numbers are bigger than {n}')
else:                                               # якщо є такі елементи, виведення їх добутку
    print(f'Composition of elements that smaller than {n}: {dob}')