# Чернеги Вікторії   Б19_д/122Б
'''
Знайти суму всіх елементів масиву цілих чисел, які менше середнього
арифметичного елементів масиву. Розмірність масиву - 20. Заповнення масиву
здійснити випадковими числами від 150 до 300.
'''

import numpy as np                                  # імпортування бібліотек
import random

array = np.zeros(20, dtype = int)                   # масив, заповнений нулями типу int
sum1, sum = 0, 0                                    # змінна, шо позначає суму елементів, остача від ділення на 2 яких дорівнює 3
for i in range(len(array)):                         # цикл для заповнення масиву елементами
    array[i] = random.randint(150, 300)             # внесення рандомних елементів в діапазоні від 150 до 300 в масив
    sum1 += array[i]                                # сума всіх елеменетів масиву
print(array)                                        # виведення масиву
mid = sum1/len(array)                               # середнє арифметичне всіх елементів масиву
for i in range(len(array)):                         # цикл для проходження по елементам масиву
    if array[i] < mid:                              # перевірка чи елемент менший середнього арифметичного
        sum += array[i]                             # якщо так, елемент додається
print(f'Amount of such elements: {sum}')            # виведення суми елементів, що менші середнього арифметичного