# Чернеги Вікторії   Б19_д/122Б
'''
Знайти суму елементів масиву цілих чисел, які діляться на 5 і на 8
одночасно. Розмірність масиву - 30. Заповнення масиву здійснити випадковими
числами від 500 до 1000.
'''

import numpy as np                                  # імпортування бібліотек
import random

array = np.zeros(30, dtype = int)                   # масив, заповнений нулями типу int
sum = 0                                             # змінна, шо позначає суму елементів, що діляться на 5 і 8
for i in range(len(array)):                         # цикл для заповнення масиву елементами
    array[i] = random.randint(500, 1000)            # внесення рандомних елементів в діапазоні від 500 до 1000 в масив
print(array)                                        # виведення масиву
for i in range(len(array)):                         # цикл для проходження по елементам масиву
    if array[i]%5 == 0 and array[i]%8 == 0:         # якщо елемент масиву ділиться на 5 і 8, то цей елемент додається
        sum += array[i]
if sum == 0:                                        # якщо елементів, що діляться на 5 і 8 націло немає, виведення інформаці про це
    print('There is no such elements')
else:                                               # якщо такі елементи є, виведення їх суми
    print(f'Amount: {sum}')