# Чернеги Вікторії   Б19_д/122Б
'''
Лінійний масив містить відомості про кількість опадів, що випали за
кожен з 12 місяців одного року. Складіть програму, що визначає загальну кількість
опадів протягом цього року, середньомісячну кількість опадів, кількість посушливих
місяців (коли кількість опадів було менше 30 мм), найпосушливіший місяць року.
'''

array = [23, 45, 67, 130, 14, 87, 55, 39, 90, 71, 28, 20]           # масив із заданими опадами
sum, sum1 = 0, 0                                                    # змінні для загальної суми елементів та суми найпосушливіших місяців, що будуть обчислюватись
for i in range(len(array)):                                         # цикл для проходження по елементам масиву
    sum += array[i]                                                 # сума всіх опадів
    if array[i] < 30:                                               # перевірка чи елемент масиву менший 30 (чи посушливий місяць)
        sum1 += 1                                                   # якщо так, додавання місяця до суми
    if array[i] == min(array):                                      # перевірка чи елемент масиву дорівнює мінімальному значенню
        print(f'The most rainless month is number {i+1}')           # якшо так, виведення номеру місяця як найпосушливішого
print(f'Amount of fall-outs: {sum}')                                # виведення суми всіх опадів
print(f'Average: {sum/len(array)}')                                 # виведення середньої кількості опадів
print(f'Amount of rainless months: {sum1}')                         # виведення кількості посушливих місяців
