# Чернеги Вікторії   Б19_д/122Б
'''
Знайти кількість парних елементів одновимірного масиву.
'''

import numpy as np                                      # імпортування бібліотек
import random

n = int(input('Quantity of elements in array: '))       # кількість елементів масиву(задає користувач)
A = np.zeros(n, dtype = int)                            # масив, заповнений нулями
total = 0                                               # змінна кількості парних чисел
for i in range(len(A)):                                 # цикл для проходження по елементам масиву
    A[i] = random.randint(-100, 100)                    # заповнення масиву числами від -100 до 100 рандомно
    if A[i]%2 == 0:                                     # умова парності елементу масиву
        total += 1                                      # якщо умова виконується, додається 1 парний елемент
print(A)                                                # вивід масиву
print(f'Quantity of binate numbers is {total}')         # вивід кількості паних елементів масиву