# Чернеги Вікторії   Б19_д/122Б
'''
Знайти кількість парних елементів одновимірного масиву до першого
зустрінутого числа рівного наперед заданому числу а.
'''

import numpy as np                                      # імпортування бібліотеки

n = int(input('Quantity of elements in array: '))       # кількість елементів масиву(задає користувач)
a = int(input('Input your number'))                     # введення числа, до якого будуть шукатись парні числа
array = np.zeros(n, dtype = int)                        # масив, заповнений нулями типу int
sum = 0                                                 # змінна, яка буде обраховувати суму парних значень елементів масиву до числа а
for i in range(len(array)):                             # цикл для проходження по елементам масиву
    array[i] = int(input(f'Element {i} = '))            # заповнення масиву
print(array)                                            # виведення масиву
for i in range(len(array)):                             # цикл, для проходження по елементам масиву
    if array[i] == a:                                   # перевірка чи елемент не дорівнює числу а
        break                                           # переривання циклу, у випадку виконання умови
    elif array[i] %2 == 0:                              # якщо елемент парний, то додавання 1 до суми кількості парних елементів
        sum += 1
print(f'Quantity of binate elements in array to {a} is {sum}')      # виведення кількості парних елементів масиву до числа а