# Чернеги Вікторії   Б19_д/122Б
'''
Обчислити середнє арифметичне значення тих елементів одновимірного
масиву, які розташовані за першим по порядку мінімальним елементом.
'''

import numpy as np                                  # імпортування бібліотек
import random

n = int(input('Quantity of elements in array: '))           # кількість елементів масиву(задає користувач)
array = np.zeros(n, dtype = int)                            # масив, заповнений нулями
sum, sum1 = 0, 0                                            # змінні, для обчислення суми елементів масиву після мінімального числа та кількості елементів, що знаходяться після мінімального числа
for i in range(len(array)):                                 # цикл для проходження по елементам масиву
    array[i] = random.randint(-100, 100)                    # заповнення масиву числами від -100 до 100 рандомно
    if array[i] == min(array):                              # якщо елемент масиву мінімальний, то його позиція присвоюється у змінну m
        m = i
print(array)                                                # вивід масиву
for i in range(m+1, len(array)):                            # проходження по елементам масиву, починаючи з наступного після мінімального значення до кінця масиву
    sum += array[i]                                         # додавання елементів масиву, що знаходяться після мінімального
    sum1 += 1                                               # додавання кількості елементів, що знахоляться після мінімального
print(f'Average of array from minimal element to the end: {sum/sum1}')      # виведення серенього значення елементів, що знаходяться після мінімального(ділення суми цих елементів на їх кількість)
