# Чернеги Вікторії   Б19_д/122Б
'''
Обчислити середнє арифметичне значення тих елементів одновимірного
масиву, які потрапляють в інтервал від -2 до 10.
'''


import numpy as np                                          # імпортування бібліотек
import random

n = int(input('Quantity of elements in array: '))           # кількість елементів масиву(задає користувач)
array = np.zeros(n, dtype = int)                            # масив, заповнений нулями
sum = 0                                                     # змінна, для обчислення суми елементів масиву, що знаходяться в діапазоні від -2 до 10
for i in range(len(array)):                                 # цикл для проходження по елементам масиву
    array[i] = random.randint(-10, 10)                      # заповнення масиву числами від -10 до 10 рандомно
    if -2 <= array[i] <= 10:                                # якщо елемент масиву знаходиться в діапазоні від -2 до 10, то він додається
        sum += array[i]
print(array)                                                # вивід масиву
print(f'Average: {sum/len(array)}')                         # виведення середнього