# Чернеги Вікторії   Б19_д/122Б
'''
Заданий масив А (1:20). Знайти добуток всіх його ненульових елементів.
'''

import numpy as np                                          # імпортування бібліотек
import random


array = np.zeros(20, dtype = int)                           # масив, заповнений нулями
dob = 1                                                     # змінна, якій буде присвоюватись значення добутку
for i in range(len(array)):                                 # цикл для проходження по елементам масиву
    array[i] = random.randint(-5, 5)                        # заповнення масиву числами від -5 до 5 рандомно
    if array[i] != 0:                                       # якщо елемент масиву не нульовий, то він множиться
        dob *= array[i]
print(array)                                                # виведення масиву
print(f'Composition of not zero elements: {dob}')           # виведення добутку не нульових елементів