# Чернеги Вікторії   Б19_д/122Б
'''
Дан лінійний масив цілих чисел. Перевірте, чи є він упорядкованим по спаданню.
'''

import numpy as np                                          # імпортування бібліотек

n = int(input('Quantity of elements in array: '))           # кількість елементів масиву(задає користувач)
array = np.zeros(n, dtype = int)                            # масив, заповнений нулями
for i in range(len(array)):                                 # цикл для проходження по елементам масиву
    array[i] = int(input(f'Element №{i} = '))               # заповнення масиву
print(array)                                                # виведення масиву
flag = True                                                 # прапорець, що змінить своє значення, якщо масив розсортований не за спаданням
for i in range(1, len(array)):                              # цикл для проходження по елементам масиву
    if array[i] <= array[i-1]:                              # якщо елемент масиву менший за попередній, то прапорець змінює своє значення і цикл припиняється
        flag = False
        break
if flag == False:                                           # якщо прапорець змінив своє значення, виведення інформації про те, що масив не розсортований за спаданням
    print('The array is sorted by descending')
else:                                                       # в іншому випадку - масив розсортований за спаданням
    print("The array isn't sorted by descending")