# Чернеги Вікторії   Б19_д/122Б
'''
Знайти суму додатніх елементів лінійного масиву цілих чисел.
Розмірність масиву - 10. Заповнення масиву здійснити з клавіатури.
'''

import numpy as np                                          # імпортування бібліотек


array = np.zeros(10, dtype = int)                           # масив, заповнений нулями
sum = 0                                                     # змінна, що позначає суму додатніх елементів масиву
for i in range(len(array)):                                 # цикл для проходження по елементам масиву
    array[i] = int(input(f'Element №{i} = '))               # заповнення масиву
    if array[i] > 0:                                        # якщо елемент масиву додатній, то він додається до суми
        sum += array[i]
print(array)                                                # виведення масиву
print(f'Amount of positive elements: {sum}')                # виведення суми всіх додатніх елементів