# Чернеги Вікторії   Б19_д/122Б
'''
Розсортуйте заданий лінійний масив по зростанню.
'''

import numpy as np                                          # імпортування бібліотек
import random


k = int(input('Quantity of elements in array = '))          # введення кількості елементів масиву
A = np.zeros(k - 1, dtype=int)                              # заповнення масиву нулями типу int
for i in range(len(A)):                                     # цикл, для проходження по елементам масиву
    A[i] = random.randint(-100, 100)                        # введення рандомних значень в масив в діапазоні від -100 до 100
print(A)                                                    # виведення нового масиву
for i in range(1, len(A)):                                  # цикл для порівняння елементів масиву
    x = A[i]                                                # значення елемента масиву на і-тій позиції
    left = 0                                                # ліва границя
    right = i - 1                                           # права границя
    while left <= right:                                    # цикл, що виконується, якщо ліва границя менша правої
        middle = (left + right) // 2                        # знаходження середини між границями
        if x < A[middle]:                                   # якщо і-тий елемент менше середнього, то права границя зміщується
            right = middle - 1
        else:                                               # в іншому випадку зміщується ліва границя
            left = middle + 1
    for j in range(i - 1, left - 1, -1):                    # цикл для обміну елементів
        A[j + 1] = A[j]                                     # зміщення більших елементів масиву вправо
    A[left] = x                                             # заміна крайнього зліва елемента на найменший
print(f'Ascending sorted array: {A}')                       # виведення відсортованого вставками масиву за зростанням