# Чернеги Вікторії   Б19_д/122Б
'''
Дані про температуру повітря і кількості опадів за декаду квітня
зберігаються в масивах. Визначити кількість опадів, що випали у вигляді дощу і у
вигляді снігу за цю декаду.
'''

import numpy as np                                                  # імпортування бібліотек
import random


temp, fall = np.zeros(10, dtype = int), np.zeros(10, dtype = int)   # масиви, заповнені нулями
rain, snow = 0, 0                                                   # змінні, для обчислення кількості опадів
for i in range(len(temp)):                                          # цмкл для прохолдення по елементам масиву
    temp[i] = random.randint(-15, 30)                               # заповнення масиву числами від -15 до 30 рандомно
    fall[i] = random.randint(0, 100)                                # заповнення масиву числами ві 0 до 100 рандомно
    if temp[i] <= 0:                                                # якщо, температура нище нуля, то опади додаються до дощових
        snow += fall[i]
    else:                                                           # якщо, температура вище нуля, то опади додаються до сніжних
        rain += fall[i]
print(f'Temperature: {temp}')                                       # виведення масиву з температурами
print(f'Fall-outs: {fall}')                                         # виведення масиву з опадами
print(f'Amount of rain fall-outs: {rain}')                          # виведення кількості дощових опадів
print(f'Amount of snow fall-outs: {snow}')                          # виведення кількості сніжних опадів