# Чернеги Вікторії   Б19_д/122Б
'''
Обчислити суму парних елементів одновимірного масиву до першого
зустрінутого нульового елемента.
'''


import numpy as np                                          # імпортування бібліотек

n = int(input('Quantity of elements in array: '))           # кількість елементів масиву(задає користувач)
array = np.zeros(n, dtype = int)                            # масив заповнений нулями типу int
sum = 0                                                     # змінна, що позначає суму елементів
for i in range(len(array)):                                 # цикл для заповнення елементів значеннями з клавіатури
    array[i] = int(input(f'Element{i} = '))
print(array)                                                # виведення масиву
for i in range(len(array)):                                 # цикл, для проходження по елементпм масиву
    if array[i] != 0:                                       # якщо елемент масиву не нульовий, то він додається
        sum += array[i]
    else:                                                   # в іншому випадку цикл переривається
        break
print(f'Amount of elements located before 0: {sum}')        # виведення суми елеметів, що знаходяться до першого 0