# Чернеги Вікторії   Б19_д/122Б
'''
Підрахувати кількість елементів одновимірного масиву, для яких
виконується нерівність i*i<a[i]<i!
'''


import numpy as np                                          # імпортування бібліотек
import random


n = int(input('Quantity of elements in array: '))           # кількість елементів масиву(задає користувач)
array = np.zeros(n, dtype = int)                            # масив, заповнений нулями
count = 0                                                   # лічильник кількості елементів, що задовільняють умову
for i in range(len(array)):                                 # цикл для проходження по елементам масиву
    array[i] = random.randint(-10, 10)                      # заповнення масиву числами від -10 до 10 рандомно
    k = i                                                   # присвоєння значенння елемента в іншу змінну, щоб використовувати його в циклі while
    i_fact = 1                                              # зінна факторіала елемента масиву
    while k > 0:                                            # цикл для знаходження факторіала числа
        i_fact *= k                                         # поки елемент додатній,множимо його на змінну факторіала
        k -= 1                                              # зменшуємо елемент на 1, щоб кожного разу факторіал мноєився на менше число
    if i*i < array[i] < i_fact:                             # якщо виконується умова, то до лічильника додається 1
        count += 1
print(array)                                                # виведення масиву
print(f'Quantity of elements: {count}')                     # виведення кількості елементів, що задовільняють умову