# Чернеги Вікторії   Б19_д/122Б
'''
Задано два натуральних числа a і b. Змінній w привласнити значення
істина, якщо в одновимірному цілочисельному масиві є хоча б один елемент, кратний а
і не кратний b.
'''

import numpy as np                                          # імпортування бібліотек
import random

a, b = int(input('A = ')), int(input('B = '))               # введення чисел, на які буде ділитись елеменет
n = int(input('Quantity of elements in array: '))           # кількість елементів масиву(задає користувач)
array = np.zeros(n, dtype = int)                            # масив, заповнений нулями
w = False                                                   # значення зміної false
for i in range(len(array)):                                 # цикл для проходження по елементам масиву
    array[i] = random.randint(-10, 10)                      # заповнення масиву числами від -10 до 10 рандомно
    if array[i] %a == 0 and array[i] %b != 0:               # якщо елемент масиву ділиться націло на а, але на b -ні, то w - True
        w = True
print(array)                                                # вивід масиву
print(w)                                                    # виведення значення w