# Чернеги Вікторії   Б19_д/122Б
'''
Підрахуйте кількість елементів одновимірного масиву, які збігаються зі
своїм номером і при цьому кратні 3.
'''

import numpy as np                                          # імпортування бібліотек
import random


n = int(input('Quantity of elements in array: '))           # кількість елементів масиву(задає користувач)
array = np.zeros(n, dtype = int)                            # масив, заповнений нулями
count = 0                                                   # лічильник кількості максимальних елементів
for i in range(len(array)):                                 # цикл для проходження по елементам масиву
    array[i] = random.randint(0, 20)                        # заповнення масиву числами від 0 до 20 рандомно
    if array[i] == i and array[i] %3 == 0:                  # якщо виконується умова, то до лічильника додається 1
        count += 1
print(array)                                                # виведення масиву
print(f'Quantity of elements: {count}')                     # виведення кількості елементів, що задовільняють умову