# Чернеги Вікторії   Б19_д/122Б
'''
Перетин даху має форму півкола з радіусом R м. Сформувати таблицю,
яка містить довжини опор, які встановлюються через кожні R / 5 м.
'''

import numpy as np                                          # імпортування бібліотек
import random


n = int(input('Quantity of elements in array: '))           # кількість елементів масиву(задає користувач)
array = np.zeros(n, dtype = int)                            # масив, заповнений нулями
R = int(input('R = '))                                      # введення радіуса даху
for i in range(0, len(array), R//5):                        # цикл для проходження по елементам масиву з кроком R//5
    array[i] = random.randint(0, 20)                        # заповнення масиву числами від 0 до 20 рандомно (заповнюються тільки елементи, що відповідають кроку, всі інші нульві)
print(array[::R//5])                                        # виведення масиву з видаленням всіх елементів між R//5(всі нульові елементи)