# Чернеги Вікторії   Б19_д/122Б
'''
Перетин даху має форму півкола з радіусом R м. Сформувати таблицю,
яка містить довжини опор, які встановлюються через кожні R / 5 м.
'''

import numpy as np                                          # імпортування бібліотек
import math


array = []                                                  # пустий масив
R = int(input('R = '))                                      # введення радіуса даху
for i in range(1, 10):                                      # цикл для знаходження значення опор(буде проходити 9 разів, оскільки при поділу R/5, враховується 9 опор)
    a = R/5 * i                                             # a i b - довжини, на які і-та опора ділить діаметр півкола 
    b = 2*R - a
    k = math.sqrt(a*b)                                      # значення довжини опори за формулою
    array.append(round(k, 2))                               # додавання округленого до двох знаків значення довжини опори
print(np.array(array))                                      # виведення масиву із значеннями довжин опор, що розташовані через кожних R/5 метрів
