# Чернеги Вікторії   Б19_д/122Б
'''
Задана таблиця назв товарів, що випускаються заводом. Визначте, чи
повторюється в цій таблиці назва першого товару, і, якщо повторюється, видаліть
назву першого товару з таблиці.
'''

import numpy as np                                          # імпортування бібліотек

def deleting():                                             # створення функції видалення першого елемнета з масиву
    for i in range(1, n):                                   # цикл для проходження по елементам, починаючи з другого (оскільки перший буде порівнюватись з іншими)
        if list[0] == list[i]:                              # якщо перший елемнет не єдиний, він видаляєьбся і цикл переривається
            list.remove(list[0])
            break

n = int(input('Quantity of elements in array: '))           # кількість елементів масиву(задає користувач)
list = []                                                   # створення списку, щоб в нього додавати елементи
for i in range(n):                                          # цикл для заповнення спику елемнетами
    k = input('list: ')
    list.append(k)                                          # додавання елемента у список
print(list)                                                 # виведення списку
while n > 0:                                                # поки не пройдемо по всім елементам списку, цикл не завершиться
    deleting()                                              # виклик функції, що видаляє перший елмент зі списку, якшщо він не єдиний
    n -= 1                                                  # зменшення кількості елементів
print(np.array(list))                                      # перетворення списку на масив та його виведення
