# Чернеги Вікторії   Б19_д/122Б
'''
У лінійному масиві знайти максимальний елемент. Вставте порядковий
номер елемента за ним, пересунувши всі залишилися на одну позицію вправо.
'''

import numpy as np                                          # імпортування бібліотек
import random

n = int(input('Quantity of elements in array: '))           # кількість елементів масиву(задає користувач)
array = np.zeros(n, dtype = int)                            # масив, заповнений нулями
for i in range(len(array)):                                 # цикл для проходження по елементам масиву
    array[i] = random.randint(-10, 10)                      # заповнення масиву числами від -10 до 10 рандомно
print(array)                                                # виведення масиву
for i in range(len(array)):                                 # цикл лоя прохолдення по елементам масиву
    if array[i] == max(array):                              # якщо елемент масиву є максимальним, в кінець масиву додається ще один елемент, рівний нулю
        array = np.append(array, 0)
        for j in range(-1,-(n-i), -1):                      # цикл для проходження по елементам масиву з кінця до максимального елемента
            array[j] = array[j-1]                           # зсув всіх елементів, що знаходяться після максимального на одну позицію
        array[i+1] = i                                      # додавання в масив значення позиції максимального елемента одразу після самого максимального елемента
print(array)                                                # виведення нового масиву
