# Чернеги Вікторії   Б19_д/122Б
'''
Наведено список прізвищ брокерів товарної біржі з N чоловік. Поміняйте
місцями прізвища брокерів: першого і останнього, другого і передостаннього, третього
з початку і третього від кінця і т.д.
'''

import numpy as np                                          # імпортування бібліотек


n = int(input('Quantity of elements in array: '))           # кількість елементів масиву(задає користувач)
surname = np.array([input(f'Surname №{i}: ') for i in range(n)])        # введення в масив прізвиш з клавіатури в діапазоеі заданого числа n, за допомогою генератора
print(surname)                                              # виведення масиву
surname1 = np.array(surname)                                # копіювання масиву у нову змінну, яку ми будемо викристовувати при заміні
for i in range(n):                                          # цикл для проходження поелеменам масиву
    surname[i] = surname1[n-i-1]                            # заміна елементів, шляхом копіювання з масиву surname1
print(surname)                                              # виведення масиву з переставленими елементами