# Чернеги Вікторії   Б19_д/122Б
'''
Задано дві таблиці. Одна містить найменування послуг, а інша - розцінки
за ці послуги. Видаліть з обох таблиць все, що передує послузі, ціна якої G гривень.
'''

import numpy as np                                          # імпортування бібліотек




G = int(input('Your number is '))                           # число, з яким буде порівнюватись ціна послуги
n = int(input('Quantity of elements in array: '))           # кількість елементів масиву(задає користувач)
service, price = [], []                                     # пусті списки для послуг та їх цін
for i in range(n):                                          # цикл для заповнення елементами списків з послугами та їх цінами
    k = input(f'Service №{i}: ')                            # елемент з назвою послуги
    m = int(input(f'Price of {k}: '))                       # елемент з ціною послуги
    service.append(k)                                       # додавання до списку з послугами назви послуги
    price.append(m)                                         # додавання до списку з цінами вартостей послуг
print(service)                                              # виведення створених списків
print(price)
for i in range(n):                                          # цикл для проходження по спискам
    if price[i] == G:                                       # перевірка чи елемент в списку цін дорівнює заданому числу
        while i > 0:                                        # цикл для видалення елементів перед ціною, що дорівнює заданому числу
            price.remove(price[0])                          # видалення ціни та послуги
            service.remove(service[0])
            i -= 1                                          # зменшення індекса на одиницю(бо кодного разу зі списків видаляється по одному елементу)
        break                                               # переривання циклів, оскільки видалені всі потрібні елементи
print(np.array(service))                                    # перетворення списків у масиви та їх виведення
print(np.array(price))