# Чернеги Вікторії   Б19_д/122Б
'''
Створіть масив А [1..7] за допомогою генератора випадкових чисел і
виведіть його на екран. Збільште всі його елементи в 2 рази.
'''

import numpy as np                      # імортування бібліотек
import random
A = np.zeros(7, dtype = int)            # створення масиву, що заповнений нулями типу int
for i in range(7):                      # цикл для проходження по елементам масиву
    A[i] = random.randint(1, 7)         # внесення в масив чисел від 1 до 7 за допомогою генератора вирадкових чисел
print(A)                                # виведення масиву
for i in range(7):                      # цикл для проходження по елементам масиву
    A[i] *= 2                           # подвоєння кожного елемента масиву
print(A)                                # виведення подвоєного масиву