# Чернеги Вікторії   Б19_д/122Б
'''
Знайти найбільший елемент з елементів одновимірного масиву, що мають
парний номер. Визначити, чи є він єдиним.
'''

import numpy as np                                          # імпортування бібліотек
import random

n = int(input('Quantity of elements in array: '))           # кількість елементів масиву(задає користувач)
array = np.zeros(n, dtype = int)                            # масив, заповнений нулями
count = 0                                                   # лічильник для кількості повторень максимального елемента на парній позиції
for i in range(len(array)):                                 # цикл для проходження по елементам масиву
    array[i] = random.randint(-10, 100)                     # заповнення масиву числами від -10 до 100 рандомно
print(array)                                                # виведення масиву
array1 = np.array(array[::2])                               # зріз масиву (залишаються лише начення із парними індексами) і присвоєння його новій змінній
for i in range(len(array)):                                 # цикл для знаходження кількості повторень максимального елементп з парною позицією
    if max(array1) == array[i]:                             # якщо в початковому масиві є елемент, що дорівнює максимальному елементу зі зрізаного масиву, до лічильника додається 1
        count+=1
if count > 1:                                               # якщо лічильник більше 1, елемент не один і виводить інформація про те, що він не єдиний
    print(f'The element {max(array1)} is not unique')
else:                                                       # в іншому випадку виводиться інформація про унікальність максимального елемента на парній позиції та його значення
    print(f'The element {max(array1)} is unique')