# Чернеги Вікторії   Б19_д/122Б
'''
В масиві X (1: n) кожен елемент рівний 0, 1 або 5. Переставити елементи
масиву так, щоб спочатку розташовувалися всі нулі, потім все одиниці, а потім всі
п'ятірки. Додаткового масиву не заводити.
'''

import numpy as np                                          # імпортування бібліотек


n = int(input('Quantity of elements in array: '))           # кількість елементів масиву(задає користувач)
array = np.array([int(input(f'{i+1}) Input 0, 1, or 5: ')) for i in range(n)])     # введення нулів, одиниць і п'ятірок в масив
print(array)                                                # виведення масиву
print(np.array(sorted(array)))                              # виведення відсортованого масиву