# Чернеги Вікторії   Б19_д/122Б
'''
Введіть масив з 20 елементів і визначте, чи є в ньому елементи з
однаковими значеннями.
'''

import numpy as np                                          # імпортування бібліотек


array = np.array([int(input(f'{i+1}) Input an element: ')) for i in range(20)])     # введення елементів в масив з клавіатури
print(array)                                                # виведення масиву
count = 0                                                   # лічильник однакових елементів
for i in range(len(array)):                                 # цикл для проходження по елементам масиву
    for j in range(i+1, len(array)):                        # цикл, для порівняння одного елемента масиву зі всіма іншими, починаючи з i+1, щоб не перевіряись повторно елементи, що вже порівнювались і не перевірялись елементи, що мають однакові позиції
        if array[i] == array[j]:                            # якщо елементи збігаються, до лічильника додається 1
            count += 1
if count > 0:                                               # якщо в лічильник додались елементи, то виведиться інформація про те, що в масиві є повторювані значення
    print('There are identical elements')
else:                                                       # в іншому випадку виводиться протилежне
    print('There is no identical elements')