# Чернеги Вікторії   Б19_д/122Б
'''
У будинку, що складається з 30 квартир, переселити мешканців так, щоб
мешканці першої квартири переїхали в тридцяту, з тридцятого - в першу, з другої - в 29
і т.д., знайдіть кількість квартир, в яких проживає більше 5 осіб.
'''

import numpy as np                                          # імпортування бібліотек
import random


array = np.array([random.randint(0, 10) for i in range(30)])     # заповнення масиву мешканцями в 30 квартирах
print(array)                                                # виведення масиву
count = 0                                                   # лічильник кількості квартир, в яких проживає більше ніж 5 осіб
array1 = np.array(array)                                    # копіювання масиву у нову змінну, щоб використовувати її при обміні квартирами
for i in range(len(array)):                                 # цикл для проходження по елементам масиву
    array[i] = array1[len(array)-i-1]                       # заміна елементів першого масиву на відповідний елемент другого з кінця
    if array[i] > 5:                                        # якщо у квартирі проживає більше 5 осіб, то до лічильника додається 1
        count += 1
print(array)                                                # виведення масиву зі змінами
print(f'Quantity of apartments with more than 5 dwellers: {count}')     # виведення кількості квартир, в яких проживає більше 5 осіб