# Чернеги Вікторії   Б19_д/122Б
'''
Якщо в одновимірному масиві є три поспіль однакових елемента, то
змінній r привласнити значення істина.
'''

import numpy as np                                          # імпортування бібліотек
import random

n = int(input('Quantity of elements in array: '))           # кількість елементів масиву(задає користувач)
array = np.array([random.randint(0,7) for i in range(n)])   # масив, заповнений рандомними значеннями в діапазоні від 0 до 7
print(array)                                                # виведення масиву
r = False                                                   # присвоєння r значення Fasle
for i in range(n-2):                                        # цикл для проходження по елементам масиву(n-2, тому що в циклі перевіряється на два значення вперед)
    if array[i] == array[i+1] and array[i] == array[i+2]:   # перевірка чи три елементи підряд є однаковими
        r = True                                            # якщо так, то значення r змінюється на True
print(r)                                                    # виведення значення r