# Чернеги Вікторії   Б19_д/122Б
'''
Відомість на зарплату представлена як дві таблиці. Одна містить
прізвища працівників цеху, а друга - їх зарплату за поточний місяць. Знайдіть прізвище
працівника, зарплата якого найменш відхиляється від середньої зарплати всіх
працівників за поточний місяць. Знайдіть прізвища двох працівників з найбільшою
заробітною платою. Видаліть з відомості на зарплату відомості про працівника,
зарплата якого мінімальна.
'''

import numpy as np                                          # імпортування бібліотек
import random


n = int(input('Quantity of elements in array: '))           # кількість елементів масиву(задає користувач)
surname = np.array([input(f'Surname №{i+1}: ') for i in range(n)])     # заповнення масиву прізвищами з клавіатури
salary = np.zeros(n, dtype = int)                           # масив, заповнений нулями, що відповідає за зарплати
sum = 0                                                     # змінна для суми всіх зарплат
for i in range(n):                                          # цикл для проходження по елементам масиву
    salary[i] = random.randint(1000, 3000)                  # заповнення масиву із зарплатами в діапазоні від 1000 до 3000
    sum += salary[i]                                        # додавання всіх значень зарплат
print(surname)                                              # виведення масивів
print(salary)
average = sum/(len(surname))                                # середнє значення всіх зарплат
dif = []                                                    # список, для різниць між зарплатами
for i in range(n):                                          # цикл для знаходження різниці зарплати працівника та середнього значення зарплат
    d = average - salary[i]
    dif.append(abs(d))                                      # занесення елементів до списку
for i in range(n):                                          # цикл для проходження по елементам масивів
    if dif[i] == min(dif):                                  # пошук мінімального значення у списку різниць зарплат і виведення прізвища людини, з відповідною зарплатнею
        print(f'Surname of the person who has the smallest difference between his salary and the average: {surname[i]}')
    if salary[i] == max(salary):                            # пошук максимального елемента зі списку зарплот та виведення прізвища людини, що отримує цю зарплату
        print(f'Person with the first the highest salary is {surname[i]}')
        salary1 = list(salary)                              # копіювання елементів х масиву зарплат у список
        salary1.remove(salary1[i])                          # видалення найбільшого значення
        for j in range(len(salary1)):                       # цикл для проходження по елеменам списку і пошуку максимального елемента в ньому (фактично, це другий максимальний елемент з масиву зарплат)
            if salary1[j] == max(salary1):
                if j >= i:                                  # виведення прізвища людини з відповідною зарплатнею
                    print(f'Person with the second the highest salary is: {surname[j + 1]}')        # j+=1, оскільки у списку на один елемент менше після видаленого раніше
                else:
                    print(f'Person with the second the highest salary is: {surname[j]}')
    if salary[i] == min(salary):                            # пошук мінімального значення заплатні та виведення прізвища людини з відповідною зарплатою
        print(f'The smalest salary has {surname[i]} - {salary[i]} dollars')
        sal, sur = list(salary), list(surname)              # занесення у списки елементів масивів із прізвищами та зарплатами
        sal.remove(sal[i]), sur.remove(sur[i])              # видалення відомостей про людину, що має найменшу зарплату зі списків
print(np.array(sur))                                        # виведення перетворених у масив списків без відомостей людини із найменшою зарплатнею
print(np.array(sal))