# Чернеги Вікторії   Б19_д/122Б
'''
Дан одновимірний масив цілих чисел. Знайдіть, скільки разів в ньому
повторюється найчастіше число.
'''

import numpy as np                                          # імпортування бібліотек


n = int(input('Quantity of elements in array: '))           # кількість елементів масиву(задає користувач)
array = np.array([int(input(f'Element №{i+1}: ')) for i in range(n)])     # заповнення масиву з клавіатури
Count= []                                                   # пустий список з кількістю повторень елементів
for i in range(n):                                          # цикл для проходження по елеменетам масиву
    count = 0                                               # занулення лічильника кількості повторень елементів
    for j in range(n):                                      # цикл для порівняння і-того елемента масиву з іншими
        if array[i] == array[j]:                            # якщо є елементи з однаковими значеннями, до лічильника додається 1
            count += 1
    Count.append(count)                                     # занесення у список кількості повторень і-того елемента
print(array)                                                # виведення масиву
for i in range(n):                                          # цикл лоя проходження по елеменетам списку
    if Count[i] == max(Count):                              # пошук максимальної кількості повторень, виведення відповідного елемента масиву та кількості його повторень
        print(f'The most often occurring element is {array[i]} ({Count[i]} times)')
        break                                               # переривання циклу після знаходження