# Чернеги Вікторії   Б19_д/122Б
'''
Дан одновимірний масив з 10 цілих чисел. Підрахуйте кількість різних чисел в ньому.
'''

import numpy as np                                          # імпортування бібліотек


n = int(input('Quantity of elements in array: '))           # кількість елементів масиву(задає користувач)
array = np.array([int(input(f'Element №{i+1}: ')) for i in range(n)])     # заповнення масиву з клавіатури
Count= []                                                   # пустий список з кількістю повторень елементів
for i in range(n):                                          # цикл для проходження по елеменетам масиву
    count = 0                                               # занулення лічильника кількості повторень елементів
    for j in range(i, n):                                   # цикл для порівняння і-того елемента масиву з іншими
        if array[i] == array[j]:                            # якщо є елементи з однаковими значеннями, до лічильника додається 1
            count += 1
    Count.append(count)                                     # занесення у список кількості повторень і-того елемента
print(array)                                                # виведення масиву
count1 = 0                                                  # лічильник кількості різних елементів
for i in Count:                                             # цикл для проходження по елемнетам списку
    if i == 1:                                              # якщо елемент рівний 1, то він додається  до лічильника
        count1 += 1
print(count1)                                               # виведення кількості різних елементів