# Чернеги Вікторії   Б19_д/122Б
'''
Створіть масив А [1..8] за допомогою генератора випадкових чисел з
елементами від -10 до 10 і виведіть його на екран. Підрахуйте кількість від’ємних
елементів масиву.
'''

import numpy as np                                      # імпортування бібліотек
import random

A = np.zeros(8, dtype = int)                            # масив, заповнений нулями
count = 0                                               # змінна кількості від'ємних чисел
for i in range(len(A)):                                 # цикл для проходження по елементам масиву
    A[i] = random.randint(-10, 10)                      # заповнення масиву числами від -10 до 10 рандомно
    if A[i] < 0:                                        # умова від'ємності елементу масиву
        count += 1                                      # якщо умова виконується, додається 1 від'ємний елемент
print(A)                                                # вивід масиву
print(f'Quantity of negative numbers is {count}')       # вивід кількості від'ємних  елементів масиву