# Чернеги Вікторії   Б19_д/122Б
'''
Дан одновимірний масив з 10 цілих чисел. Підрахуйте найбільше число
однакових чисел, що йдуть підряд в ньому.
'''

import numpy as np                                          # імпортування бібліотек


array = np.array([int(input(f'Element №{i+1}: ')) for i in range(10)])     # заповнення масиву з клавіатури
Count = []                                                  # пустий список кількостей повторів елементів
for i in range(len(array)):                                 # цикл для проходження по елементам масиву
    count = 0                                               # занулення лічильника кількості елементів, що йдуть підряд після і-того
    j = i                                                   # змінна (індекс) для проходження по елементам, з якими порівнюється і-тий
    while j < 10 and array[i] == array[j]:                  # поки j не перевищує довжини списка та і-тий елемент дорівнює j-ому, до лічильника додається 1
        count += 1
        j += 1                                              # перехід до наступного j-ого елемента
    Count.append(count)                                     # додавання кількості елементів, що йдуть підряд до списку
print(array)                                                # виведення початкового масиву
print(f'Quantity of  identical consecutive elements: {max(Count)}')     # виведення найбільшого значення зі списку - найбільшої кількості однакових елементів, що йдуть підряд