# Чернеги Вікторії   Б19_д/122Б
'''
Створіть цілочисельний масив А [1..15] за допомогою генератора
випадкових чисел з елементами від -15 до 30 і виведіть його на екран. Визначте
найбільший елемент масиву і його індекс.
'''

import numpy as np                                      # імпортування бібліотек
import random

A = np.zeros(15, dtype = int)                           # масив, заповнений нулями
for i in range(len(A)):                                 # цикл для проходження по елементам масиву
    A[i] = random.randint(-15, 30)                      # заповнення масиву числами від -25 до 30 рандомно
Max = max(A)                                            # максимальний елемент масиву
for i in range(len(A)):                                 # цикл для проходження по елементам масив(щоб знайти позицію максимального елемента)
    if A[i] == Max:                                     # умова співпадіння елементу і максимального значення
        break                                           # якщо виконується умова цикл розривається (із запам'ятовуванням останнього значення і)
print(A)                                                # виведення масиву
print(f'Maximum is number {Max} on position {i}')       # виведення масимального значення та його позиції