# Чернеги Вікторії   Б19_д/122Б
'''
З 8 до 20 години температура повітря вимірювалася щогодини. Відомо,
що протягом цього часу температура знижувалася. Визначте, о котрій годині було
вперше зафіксовано від'ємну температуру.
'''

temperature = [20, 18, 16, 17, 13, 10, 7, 5, 2, -1, -5, -6, -7]                 # масив з температурами
for i in range(len(temperature)):                                               # цикл для проходження по масиву
    if temperature[i]<0:                                                        # умова,при якій температура має бути від'ємною
        break                                                                   # переривання масиву, якщо умова виконується
print(f'The first time the temperature has fallen below zero at {i+8}:00')      # вивід часу (рахунок часу має починатися з 8, тому позиція елементу + 8)